Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/travel_and_recreation/recreational_activities_in_ireland/sport_and_leisure/public_library_services.html.txt.tmx
Source language: en
Languages: ga

source: Public libraries are open to everyone. You do not have to be a member of the library if you just want to read something in the library, ask a question or consult a reference work (for example, a telephone directory or a dictionary or an encyclopaedia)
ga: Bíonn leabharlanna poiblí ar oscailt do gach duine agus ní gá duit a bheith i do bhall den leabharlann mura bhfuil tú ach ag iarraidh rud éigin a léamh sa leabharlann, ceist a chur nó ábhar tagartha a sheiceáil (m.sh. eolaí teileafóin nó foclóir nó ciclipéid)

source: You will, however, need to join the library if you want to borrow books or other items or, in most cases, if you want to use the internet
ga: Caithfidh tú a bheith mar bhall den leabharlann má bhíonn tú ag iarraidh leabhair nó ábhair a thógáil ar iasacht nó mar a bhíonn i gceist go minic, má bhíonn tú ag iarraidh úsáid a bhaint as an Idirlíon

source: There are differences in the services particular libraries provide, depending on the size and location of the branch and on the policies of the library service
ga: Tá difríochtaí sna seirbhísí a chuireann leabharlanna áirithe ar fáil, bíonn sé sin ag brath ar a méid agus ar an áit a bhfuil an brainse suite agus ar pholasaithe an tseirbhís leabharlainne

source: All public libraries provide books which can be borrowed by members of the library
ga: Cuireann gach leabharlann phoiblí leabhair ar fáil gur féidir le muintir an phobal a thabhairt ar iasacht

source: All kinds of books can be borrowed, fiction (such as the latest bestseller or a classic novel) and non-fiction (such as history, biography, science, travel or self-help)
ga: Is féidir gach cineál leabhar a thabhairt ar iasacht, ficsean, (ar nós an leabhair is mó a díoladh le deireanasí nó úrscéal clasacach) agus leabhair nach ficsean iad (ar nós leabhair staire, beatháisnéisí, leabhair eolaíochta, leabhair taistil, leabhair féinchúnaimh ,rl.)

source: In addition to standard books, libraries also have many books in large print format, which are popular with readers with a visual impairment
ga: Chomh maith le gnáthleabhair bíonn cóipeanna ag leabharlanna de leabhair i gcruth "cló mór", a thaitníonn go mór le léitheoirí a mbíonn amharc lag acu

source: In most libraries there are adult and junior sections
ga: Bionn roinn na nÓg agus na nDaoine Aosacha i bhformhór leabharlann

source: Children up to a certain age use the junior section only which provides books and other materials especially for children
ga: Leanaí suas go dtí aois áirithe a bhaineann leas as roinn na nÓg a chuireann leabhair agus ábhair ar fáil do leanaí go speisialta

source: Books for children of all ages, from babies up to teenagers are available in the junior library
ga: Tá leabhair ar fáil i leabharlann na nÓg do leanaí ag gach aois, ó naíonáin suas go dtí déagóirí

source: If the book you want is already out on loan, you can reserve it
ga: Má bhíonn an leabhar atá ag teastáil amuigh ar iasacht ag duine éigin eile, is féidir leat an leabhar sin a chur in áirthint duit féin

source: The library will notify you when the book is available for you to borrow
ga: Cuirfidh an leabharlann ar an eolas tú nuair a bheidh an leabhar réidh le tabhairt amach ar iasacht arís

source: If the library does not have the book you want, you can request it, again by filling in a form
ga: Mura bhfuil an leabhar atá uait ag an leabharlann, is féidir leat iarratas a dhéanamh air, trí fhoirm eile a chomhlánú

source: The library may purchase the book or may look for a copy through the inter-library loan system
ga: Féadfaidh an leabharlann an leabhar a cheannach nó féadfaidh siad cóip eile a lorg trí iasacht idir-leabharlann

source: This is a system through which libraries in Ireland, the UK, and around the world, loan items to each other for the use of library members
ga: Is córas é sin inar féidir le leabharlanna in Éirinn, sa Ríocht Aontaithe agus ar fud an domhain rudaí a thabhairt ar iasacht dá chéile lena n-úsáid ag baill na leabharlainne

source: In addition to books, in most libraries you can borrow audio-books, which are recorded readings of books
ga: Chomh maith le leabhair a thógáil ar iasacht, is féidir leat leabhair-éisteachta a thógáil ar iasacht as go leor leabharlanna, agus is éard atá iontu seo ná léitheoireacht taifeadta ar na leabhair

source: Books of all kinds are available on recording and they come on both cassettes and CDs
ga: Bíonn gach cineál leabhair ar fáil atá taifeadta agus tá tú in ann iad a fháil ar caiséad agus ar CD

source: In some libraries you can borrow ebooks
ga: I roinnt leabharlanna is féidir leat e-leabhair a thógáil ar iasacht

source: In many libraries you can borrow compact discs and cassettes of music
ga: Bíonn duine in ann dlúthdhioscaí agus téipeanna ceoil a thógáil ar iasacht as go leor leabharlann

source: These range from popular chart music to traditional and classical music
ga: Bionn gach réimse ceoil orthu seo, ó cheol a bhíonn sna cairteanna go ceol traidisiúnta nó ceol clasacach

source: Some libraries have selections of prints and paintings which can also be borrowed
ga: Bíonn roinnt priontaí agus pictiúr ag leabharlainne freisin agus is féidir iad sin a thógáil ar iasacht

source: Public libraries carry a range of journals and periodicals including national and local newspapers and magazines on a variety of topics (for example, business, health and lifestyle, gardening, science, nature, history)
ga: Bíonn sraith nuachtán laethúil agus tréimhseachán i leabharlanna poiblí lena n-áirítear nuachtáin náisiúnta agus áitiúla agus irisleabhair le topaici éagsúla iontu. (m.sh. gnó, sláinte agus saol maireachtála, garraíodóireacht, eolaíocht, an nádúr, stair

source: Reference and general information services
ga: Tagairt agus Seirbhísí Eolas Ginearálta

source: All public libraries have reference sections, containing books and other materials which can be consulted in the library
ga: Bíonn roinn "tagartha" ag gach leabharlann phoiblí, ina mbíonn leabhair agus ábhair eile gur féidir a úsáid sa leabharlann

source: Reference sections typically include resources such as dictionaries, directories, encyclopaedias, government publications, business information, yearbooks and atlases
ga: Ar na rudaí is mó a bhíonn le fáil sa roinn tagartha, bíonn achmhainní mar fhoclóirí, eolaithe, ciclipéidí, foilseacháin rialtais, eolas gnó, leabhair chinn bhliana agus léarscáileanna

source: Some reference material, in particular business-related material, is available on CD or over the internet
ga: Bíonn ábhar tagartha, go háirithe ábhair gnó, le fáil ar CD nó ar an Idirlíon

source: Public libraries can also provide contact details and information on the services provided by the county council or corporation and by government departments, for example, social welfare information
ga: Is féidir le leabharlanna poiblí sonraí teagmhála a chur ar fáil chomh maith le heolas ar na seirbhísí a chuireann an chomhairle chontae nó bardas ar fáil agus chomh maith leis sin ranna rialtais, ina mbeadh eolas faoi chúrsaí leasa shóisialaigh, ,rl

source: Most libraries also hold a lot of local information about clubs and societies and events in their locality
ga: Bíonn go leor eolas áitiúil le fáil i go leor leabharlann chomh maith le heolas faoi imeachtaí clubanna agus cumann go háitiúil

source: All public libraries collect materials about the history of their county or locality
ga: Cruinníonn gach leabharlann phoiblí ábhar faoi stair a gcontae nó a n-áite féin

source: There is a huge range of material available including county and parish histories, maps, photographs, drawings, old records, and newspapers
ga: Bíonn gach cineál ábhair ar fáil lena n-áirítear stair an pharóiste agus an chontae, mapaí, grianghraif, pictiúir, seanthaifid, agus nuachtáin

source: In some cases the main local history collection will be in the county library so you should check this at your local branch
ga: I go leor cásanna bíonn an bailiúchán staire áitiúla le fáil i leabharlann an chontae mar sin ba chóir duit é sin a seiceáil ag do bhrainse áitiúil

source: All public library services now have computers which the public can use to access the internet
ga: Tá ríomhairí anois ag gach seirbhís leabharlainne poiblí ar féidir leis an bpobal úsáid a bhaint astu chun rochtain a fháil ar an Idirlíon

source: In most cases you must be a member of the library to use the computers
ga: Caitheann tú bheith i do bhall den leabharlann chun úsáid a bhaint as na ríomhairí sa chuid is mó de na cásanna

source: Usually you will have to book a session in advance but you should check this in your local branch
ga: Is iondúil go gcaithfidh tú seisiún a chur in áirithe roimh ré, ach ba cheart duit é sin a sheiceáil i do bhrainse áitiúil

source: Many libraries now offer introductory sessions for new users
ga: Tairgeann go leor leabharlann seisiúin tosaigh d’úsáideoirí nua anois

source: Individual library catalogues can be searched online by author, title or keyword
ga: Is féidir catalóga leabharlainne aonair a chuardach ar líne de réir údair, teidil nó eochairfhocail anois

source: The system is accessed using library borrower number and a personal identification number (PIN)
ga: Faightear rochtain ar an gcóras ach úsáid a bhaint as uimhir iasachtóra leabharlainne agus uimhir aitheantais phearsanta (PIN)

source: In addition, it is possible to request a book, renew loans and check borrower information such as loans and reservations online
ga: Ina theannta sin is féidir leabhar a iarraidh, iasachtaí a athnuachan agus eolas iasachtaí a cheadú ar nós iasachtaí agus áirithintí ar líne

source: Online access to digitised content from public libraries is available through, for example, askaboutireland.ie
ga: Bíonn rochtain ar líne ar ábhar digitithe ó leabharlanna poiblí ar fáil mar shampla trí askaboutireland.ie

source: Through the BorrowBooks service, library members can borrow items from across the public library authorities via their local library service
ga: Is tríd an tseirbhís BorrowBooks ar féidir le baill leabharlainne míreanna a fháil ar iasacht ó fud na n-údarás leabharlainne poiblí trí mheán a seirbhíse leabharlainne áitiúla

source: All public libraries are becoming part of Libraries Ireland which will allow anyone with a public library card borrow and reserve items from any public library
ga: Tá gach leabharlann phoiblí ag glacadh ballraíochta le Libraries Ireland, rud a ligfidh do dhuine ar bith le cárta leabharlainne poiblí chun míreanna a fháil ar iasacht agus a chur in áirithe ó leabharlann phoiblí ar bith

source: Ebooks and eaudio books can be borrowed via the BorrowBox service
ga: Is féidir ríomhleabhair agus ríomh-chlosleabhair a fháil ar iasacht trí mheán na seirbhíse BorrowBox

source: You can find more information on online services on the Department of Housing, Planning, Community and Local Government website
ga: Is féidir leat teacht ar a thuilleadh eolais i leith seirbhísí ar líne ar láithreán gréasáin na Roinne Tithíochta, Pleanála, Pobail agus Rialtais Áitiúil

source: Many public libraries, particularly the larger ones, provide resources to enable users learn or follow a course of study themselves
ga: Soláthraíonn go leor leabharlann phoiblí, go háirithe na cinn mhóra, acmhainní chun úsáideoirí a chumasú chun foghlaim nó chun cúrsa staidéir a dhéanamh dá stuaim féin

source: These include learning packs, online learning modules, learning booths, training materials and short courses
ga: Áirítear leo sin pacaí foghlama, modúil foghlama ar líne, botháin foghlama, ábhair oiliúna agus gearrchúrsaí

source: Ask for details at your local branch
ga: Fiosraigh mionsonraí ag do bhrainse áitiúil

source: Anyone can use and/or join their public library
ga: Is féidir le haon duine a bheith ina bhall den leabharlann nó an leabharlann phoiblí a úsáid

source: The number of items you can borrow at any one time and the length of time you may keep them varies
ga: Tá difríocht sa méid ábhair atá tú in ann a thógáil ar iasacht ag aon am amháin agus san achar gur féidir leat an t-ábhar a choinneáil

source: You should ask for details at your local library
ga: Faigh sonraí fúthu sin ag do bhrainse áitiúil

source: You may need to book some services, such as language learning or the internet in advance
ga: B'fhéidir go mbeadh ort roinnt seirbhísí a chur in áirthint, mar shampla ag foghlaim teanga nó an tIdirlíon roimh ré

source: Children may only borrow items from the junior library
ga: Ní féidir le leanaí iasacht a fháil ach ó leabharlann na n-Óg

source: The age at which young people may use the adult library varies so you should check this at your local library
ga: Bíonn an aois gur féidir le daoine óga úsáid a bhaint as leabharlann na nAosach difriúil i ngach leabharlann mar sin is féidir leat é sin a sheiceáil ag do leabharlann áitiúil

source: Although most services in most public libraries are free, there are some charges which you may have to pay
ga: Cé go bhfuil an chuid is mó de na seirbhísí i bhformór leabharlann áitiúil saor in aisce, bíonn táillí áirithe a chaithfidh tú a íoc

source: Some libraries have a small membership charge and most levy fines for the late return of books or other borrowed items
ga: Tá táille bheag ballraíochta ag cuid de na leabharlanna agus gearrann go leor leabharlann fineáil ar leabhair nó ar ábhar eile a bhíonn ar iasacht a thagann ar ais mall

source: There is usually a small charge for reservations or requests
ga: Bíonn táille freisin ar ábhar a chur in áirthint nó ábhar a ndéantar iarratas air

source: Ask at your local library for details
ga: Faigh eolas faoi sin ag do leabharlann áitiúil

source: All public libraries charge for photocopying
ga: Gearrann gach leabharlann phoiblí táille ar chóipeanna a fháil

source: Some requirements will vary, depending on the library service, but the following apply to most, if not all, library services:
ga: Bíonn cuid de na riachtanais difriúil, ag brath ar sheirbhís na leabharlainne, ach baineann na rialacha seo a leanas le gach seirbhís leabharlainne beagnach:

source: • In order to join the library you need to fill out an application form at any branch
ga: • Chun a bheith i do bhall den leabharlann bíonn ort foirm iarratais a chomhlánú ag aon bhrainse ar bith

source: • You must produce some proof of your identity and of your address
ga: • Caithfidh tú cruthúnas ar do chéannacht agus do sheoladh a thaispeáint

source: • If you are under 18 years of age you will have to have get someone aged over 18 (for example, a parent or guardian) to sign as a guarantor
ga: • Má tá tú faoi ocht mbliana déag d'aois beidh ar dhuine éigin os cionn ocht mbliana déag d'aois (m.sh tuismitheoir nó caomhnóir) an fhoirm a shíniú mar ráthóir thar do cheann

source: • Each library service issues its own library card which can only be used in the branches of that library service
ga: • Eisíonn gach seirbhís leabharlainne a gcárta leabharlainne féin agus ní féidir an cárta sin a úsáid ach i mbrainsí a bhaineann leis an tseirbhís leabharlainne sin

source: If you want to use the branches of more than one library service then you need to be a member of each of them
ga: Má bhíonn tú ag iarraidh brainse i níos mó ná leabharlann amháin a úsáid caithfidh tú a bheith i do bhall de gach ceann de na leabharlanna sin

source: If, for example, you want to use the libraries run by Dublin City Council and by Fingal County Council, you must become a member of both. Further information
ga: Má bhíonn tú, mar shampla, ag iarraidh úsáid a bhaint as leabharlanna Bhardas Átha Cliath agus Chomhairle Chontae Fingal, caithfidh tú a bheith i do bhall den dá leabharlann sin
